app/controllers/application_controller.rb

	def myarticle
	  if user_signed_in?
	   @article = current_user.articles.last
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? ORDER BY "articles"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]