app/controllers/article_times_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @time = @article.time
    @article_times = current_user.article_times.where(article_id: @article.id)
    @count_articles = @article_times.count

    #達成回数を増やす部分
    article_time = @article.article_times.new(user_id: current_user.id)
    article_time.save

    #+1なのはcreate実行時点では達成日数が反映されていないため
    if @count_articles + 1 == @time
      #100%達成の動き
      #実績テーブルに格納
      Achievement.create(
      user_id: current_user.id,
      article_id: @article.id,
      name: @article.name,
      start_time: @article.created_at,
      time: @time
    )
      #実績に情報を映したのでタスクを削除する
      @article_times.destroy_all
      @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "article_times".* FROM "article_times" WHERE "article_times"."user_id" = ? AND "article_times"."article_id" = ?  [["user_id", 1], ["article_id", 1]]
SELECT COUNT(*) FROM "article_times" WHERE "article_times"."user_id" = ? AND "article_times"."article_id" = ?  [["user_id", 1], ["article_id", 1]]
INSERT INTO "article_times" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["created_at", "2022-01-29 18:50:50.493968"], ["updated_at", "2022-01-29 18:50:50.493968"]]
INSERT INTO "achievements" ("user_id", "article_id", "name", "time", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["name", "筋トレ"], ["time", 3], ["created_at", "2022-01-29 19:16:49.364989"], ["updated_at", "2022-01-29 19:16:49.364989"], ["start_time", "2022-01-29"]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
DELETE FROM "article_times" WHERE "article_times"."id" = ?  [["id", 1]]
DELETE FROM "article_times" WHERE "article_times"."id" = ?  [["id", 3]]