app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "article_times" WHERE "article_times"."user_id" = ?  [["user_id", 1]]
---
  def show
    @article = Article.find_by(id: params[:id])

    @time = @article.time
	  @count_articles = current_user.article_times.count

SELECT  "articles".* FROM "articles" WHERE "articles"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def index
    @article = Article.find_by(id: params[:id])

INSERT INTO "articles" ("user_id", "name", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "筋トレ"], ["time", 20], ["created_at", "2022-01-29 05:40:56.423687"], ["updated_at", "2022-01-29 05:40:56.423687"]]
---
  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id
    @article.save