app/views/layouts/_header.html.erb

        <%= link_to 'ログアウト', destroy_user_session_path, method: :delete, class: "fas fa-sign-out-alt text-dark pr-3 d-flex align-items-center" %>
        <% if Article.exists? %>
---
SELECT  1 AS one FROM "articles" LIMIT ?  [["LIMIT", 1]]